In [21]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [22]:
df=pd.DataFrame(data={
    'feature_1':[np.nan,3,6,9,12,15,np.nan],
    'feature_2':[100,np.nan,200,300,np.nan,np.nan,600],
    'feature_3':[1000,500,2000,3000,4000,6000,8000,],
})
df

   feature_1  feature_2  feature_3
0        NaN      100.0       1000
1        3.0        NaN        500
2        6.0      200.0       2000
3        9.0      300.0       3000
4       12.0        NaN       4000
5       15.0        NaN       6000
6        NaN      600.0       8000

In [23]:
df.isnull()

   feature_1  feature_2  feature_3
0       True      False      False
1      False       True      False
2      False      False      False
3      False      False      False
4      False       True      False
5      False       True      False
6       True      False      False

In [24]:
df.isnull().sum()

feature_1    2
feature_2    3
feature_3    0
dtype: int64

In [25]:
df.fillna(method='pad',limit=1)

   feature_1  feature_2  feature_3
0        NaN      100.0       1000
1        3.0      100.0        500
2        6.0      200.0       2000
3        9.0      300.0       3000
4       12.0      300.0       4000
5       15.0        NaN       6000
6       15.0      600.0       8000

In [26]:
df.fillna(method='pad',limit=2)

   feature_1  feature_2  feature_3
0        NaN      100.0       1000
1        3.0      100.0        500
2        6.0      200.0       2000
3        9.0      300.0       3000
4       12.0      300.0       4000
5       15.0      300.0       6000
6       15.0      600.0       8000

In [27]:
df.fillna(method='bfill')

   feature_1  feature_2  feature_3
0        3.0      100.0       1000
1        3.0      200.0        500
2        6.0      200.0       2000
3        9.0      300.0       3000
4       12.0      600.0       4000
5       15.0      600.0       6000
6        NaN      600.0       8000

In [28]:
df.fillna(method='ffill')

   feature_1  feature_2  feature_3
0        NaN      100.0       1000
1        3.0      100.0        500
2        6.0      200.0       2000
3        9.0      300.0       3000
4       12.0      300.0       4000
5       15.0      300.0       6000
6       15.0      600.0       8000

In [29]:
df.dropna(axis=0)  # drops all records with any missing value

   feature_1  feature_2  feature_3
2        6.0      200.0       2000
3        9.0      300.0       3000

In [30]:
df.dropna(axis=1)  # drops all features with missing values and keep only features which are non-missing

   feature_3
0       1000
1        500
2       2000
3       3000
4       4000
5       6000
6       8000

In [31]:
df.dropna(thresh=int(df.shape[0] * .9), axis=1) # give threshold that >10% missing data be dropped

   feature_3
0       1000
1        500
2       2000
3       3000
4       4000
5       6000
6       8000

In [32]:
df.shape[0] * .9

6.3

In [33]:
df['feature_1'].fillna(df['feature_1'].mean())

0     9.0
1     3.0
2     6.0
3     9.0
4    12.0
5    15.0
6     9.0
Name: feature_1, dtype: float64

In [34]:
df['feature_2'].interpolate()

0    100.0
1    150.0
2    200.0
3    300.0
4    400.0
5    500.0
6    600.0
Name: feature_2, dtype: float64